lwfinger/rtl8723bu/hal/hal_btcoex.c
	//DBG_871X("===>Hal_ParseAntIsolationConfigFile()\n" );

	ptmp = buffer;
	for (szLine = GetLineFromBuffer(ptmp); szLine != NULL; szLine = GetLineFromBuffer(ptmp))
	{
		// skip comment
		if ( IsCommentString( szLine ) ) {
			continue;
		}

                //DBG_871X("%s : szLine = %s , strlen(szLine) = %d  \n", __FUNCTION__,szLine,strlen(szLine));
                for ( j=0 ;ant_isolation_param[j].param_name != NULL ; j++ )
                {
                        if ( strstr(szLine,ant_isolation_param[j].param_name)!= NULL )
                        {
                                i=0;
                                while ( i < strlen(szLine) )
                                {
                                        if (szLine[i] != '"')
                                                ++i;
                                        else
                                        {
                                                // skip only has one "
                                                if( strpbrk(szLine, "\"") == strrchr(szLine, '"'))
                                                {
                                                        DBG_871X("Fail to parse parameters , format error!\n");
                                                        break;
                                                }
                                                _rtw_memset( ( PVOID ) param_value_string, 0, 10 );
                                                if ( ! ParseQualifiedString( szLine, &i, param_value_string, '"' , '"' ) ) {
                                                        DBG_871X("Fail to parse parameters \n");
                                                        return _FAIL;
                                                }
                                                else
                                                {
                                                        GetU1ByteIntegerFromStringInDecimal( param_value_string, ant_isolation_param[j].value );
                                                 }
                                                break;
                                        }
                                }
                        }
                }
        }

        // YiWei 20140716 , for BT coex antenna isolation control
        if ( ant_num==3 && ant_distance>=50)
        {
                pHalData->EEPROMBluetoothCoexist = 0;
                anttype = 4;
        }
        else if ( ant_num==2 && ant_distance>=50 )
        {
                anttype = 3;
        }
        else if ( ant_num==3 &&  ant_distance>=15 &&  ant_distance<50  )
        {
                anttype = 2;
        }
        else if ( ant_num==2 && ant_distance>=15 &&  ant_distance<50 )
        {
                anttype = 1;
        }
        else if ( (ant_num==2 && ant_distance<15) ||  (ant_num==3 && ant_distance<15))
        {
                anttype = 0;
        }
        else
        {
                pHalData->EEPROMBluetoothCoexist = 1;
                anttype = 1;
        }

        hal_btcoex_SetAntIsolationType(Adapter, anttype);

        DBG_871X("%s : ant_num = %d   \n", __FUNCTION__,ant_num);
        DBG_871X("%s : ant_distance = %d  \n", __FUNCTION__,ant_distance);
        //DBG_871X("<===Hal_ParseAntIsolationConfigFile()\n");
        return rtStatus;
}


int
hal_btcoex_AntIsolationConfig_ParaFile(
	IN	PADAPTER	Adapter,
	IN	char*	 	pFileName
)
{
	HAL_DATA_TYPE		*pHalData = GET_HAL_DATA(Adapter);
	int	rlen = 0, rtStatus = _FAIL;
	//char	file_path_bu[1024];

	//if(!(Adapter->registrypriv.load_phy_file & LOAD_RF_TXPWR_LMT_PARA_FILE))
	//	return rtStatus;

	_rtw_memset(pHalData->para_file_buf, 0, MAX_PARA_FILE_BUF_LEN);


	rtw_merge_string(file_path_bu, PATH_LENGTH_MAX, rtw_phy_file_path, pFileName);

	if (rtw_is_file_readable(file_path_bu) == _TRUE)
	{
		rlen = rtw_retrive_from_file(file_path_bu, pHalData->para_file_buf, MAX_PARA_FILE_BUF_LEN);
		if (rlen > 0)
		{
			rtStatus = _SUCCESS;
		}
	}


	if(rtStatus == _SUCCESS)
	{
		//DBG_871X("%s(): read %s ok\n", __FUNCTION__, pFileName);
		rtStatus = hal_btcoex_ParseAntIsolationConfigFile( Adapter, pHalData->para_file_buf );
	}
	else
	{
		DBG_871X("%s(): No File %s, Load from *** Array!\n", __FUNCTION__, pFileName);
	}

	return rtStatus;
}
#endif // CONFIG_LOAD_PHY_PARA_FROM_FILE
#endif // CONFIG_BT_COEXIST

